{
  "address": "4_1_5_ B_r_a_in_a_r _d_ S_t_. _________________",
  "city": "t",
  "state": "Michigan",
  "level_of_significance": "local",
  "areas_of_significance": [],
  "period_of_significance": "1924-1940",
  "description": "The \nArchitects Building \nwas built as \na \nseven-story commercial \nbuilding with its reinforced concrete frame faced with buff brick \nand \ntrimmed \nin \nstone, \nresulting \nin \na \nNeo-Classical \nRevival \ncomposition. \nLocated in Detroit's Cass Corridor, an area less than \none mile north of the traditional downtown that has experienced \ntremendous physical change due to the demolition of buildings, the \nArchitects Building is oriented towards Brainard. \nIt abuts the \npublic sidewalk; a row of buildings to its south faces Cass Avenue. \nIt is the tallest building in the immediate vicinity, with four-\nstory apartment buildings and later one and two-story commercial \nbuildings nearby. \nIts exterior is in good condition, although \nalterations to the storefronts have occurred. \nThe first floor \nlobby, the most significant space in the building, is still intact. \nThe Architects Building is a seven-story reinforced concrete office \nbuilding with stores on the first floor. \nIt is faced in stretcher \nbond buff brick with stone trim, and it measures 46 feet wide by \n84. 2' long by 84' high. \nThe building is Neo-Classical Revival in \nstyle. \nThe front of the ground floor is faced in stone; the main \nentrance to the building is on the far east side of the front \nfacade. \nIt is composed \nof \na \nsingle recessed \narched \nopening \nsurmounted by quoins that result in a rusticated appearance. \nA \nscrolled keystone is the only molded detail around the entrance; \nindications of bronze letters giving the address of the building, \n\"415 Brainard,\" \nand its name, \n\"Architects Building,\" flank \nthe \nopening. \nThe two recessed storefronts, transoms and flanking \ndisplay windows are now boarded. \nThe westernmost bay is bricked in \non the bottom and is not recessed, indicating a secondary entrance \nor window. \nA molded belt course divides the second and third stories. \nWindows \nare paired above the entrance bay in floors two through seven, but \nare otherwise evenly spaced. \nA plain stone frieze divides the \nsixth and seventh floors. \nCentered between the fourth and fifth \nstories of the front facade is a large cartouche bearing a stylized \nletter \"A\" flanked by festoons. \nA molded string course beneath the \nseventh-story windows \nserves as that story's window sills. \nA \ndenticulated cornice crowns the top of the front facade, turning \nthe west corner. \nThe east side elevation of \nthe Architects Building \ni s \nmost l y \nunfenestrated, due to a formerly abutting building. \nThe reinforced \nconcrete frame is visible on all elevations except the front. \nThe \nwest and rear elevations are fully fenestrated; a metal fire escape \nhangs on the west elevation. \n\nARCHITECTS BUILDING \nWayne County, MI \nCONTINUATION SHEET \n7. \nNarrative Descrigtion I Page 2 \nThe interior of the building is organized from the first floor \nlobby inside the main front entrance. This lobby is the most \narchitecturally distinguished space in the building. \nIt contains \ntwo elevators which travel the full height of \nthe building, \nincluding \nthe \nbasement. \nA wood \nand glass wall divides the \nelevators from the vestibule. \nThe lobby features marble floors \nand walls and a decorated wood ceiling. \nImmediately adjacent to \nthe lobby is the stair tower which contains an elegant metal \nstair. \nAll floors contain small elevator lobbies with differently \nconfigured corridors. \nSome have terrazzo flooring, some with a \nterrazzo baseboard and others with a wood baseboard. \nWide office \ndoors exist throughout, \nand there is a public restroom on each \nfloor. \nBeyond the corridors are a variety of office spaces, each \nconfigured differently with no consistent layout. \n\nArchitects Building \nName or Property \nB. Statement of Sianificance \nApplicable National Register Criteria \n(Mark \" x\" in one or more boxes tor the cntena Qualitying the propeny \nlor Nat1ona1 Aeg1ster ilsung.) \ni5 A Property is associated with events that have made \na significant contribution to the broad patterns of \nour history. \nfi 8 Property is associated with the lives of persons \nsignificant in our past. \nfi C Property embodies the distinctive characteristics \nof a type. period. or method of construction or \nrepresents the work of a master. or possesses \nhigh artistic values, or represents a significant and \ndistinguishable entity whose components lack \nindividual distinction. \n:J 0 Property has yielded. or is likely to yield. \ninformation important in prehistory or history. \nCriteria Considerations \n(Mark \" x·· in all the boxes that apply.) \nProperty is: \n0 A owned by a religious institution or used for \nreligious purposes. \n[j 8 removed from its ongtnal location. \n:J C a birthplace or grave. \n:J 0 a cemetery. \n::J E a reconstructed building, object. or structure. \n= \nF a commemorative property. \nCJ G less than 50 years of age or achieved Significance \nwithin the past 50 years. \nNarrative",
  "statement_of_significance": "The Architects Building was erected in 1924 and is significant for \nits original purpose of bringing architectural professionals and \ntrades under one roof, for the several significant architects who \noriginally occupied it, most notably Richard H. Marr and Marcus R. \nBurrowes, and for the architectural character of both the exterior \nand interior of the building. \nIts associations with the building \narts \nended \nsometime \nafter \n1940, \nthe last \nyear \nit could \nbe \ndocumented that Marr and Burrowes kept offices in the building. \nDetroit's phenomenally rapid growth in the second decade of the \ntwentieth century was due to industrial expansion most marked by \nthe automobile industry. \nThe population of Detroit rose 113 per \ncent from 1910 through 1920, according to the United States Census \nfigures, rising from 465,766. to 993,739, and \nsixty-three per cent \nfrom 1920 to 1930, rising to 1,568,662 in 1930. \nThe area of the \ncity had a corresponding expansion; it contained a total area of \n39.93 square miles i n 1907 and grew to 75.62 square miles in 1920. \nNo major American city grew more rapidly in this period. \nThis \ntremendous expansion in size and population resulted in a building \nboom. \nThe \nvast \namount \nof \nbuilding \nbrought \na \ncorresponding \nincrease \nin \nthe \nnumber \nof \narchitectural, \nengineering \nand \ncontracting \nfirms \nand \nother \nbuilding-related \nprofessions \nand \ntrades. \nThe enormous growth in the number of these firms made a \nbuilding such as the Architects Building, designed to house them, \nfeasible for the first time. \nRichard H. Marr is listed on building permit #36669, issued on May \n7, \n19 24, \nas archi teet of the building at 415 Brainard. \nIts \nestimated cost of construction was $135,000. \nMarr was known in \nthe Detroit area for high class residential design. \nHe was a \nDetroit native of Scotish descent, born in 1886. \nMarr worked for \nGeorge D. Mason, the Detroit archi teet, as a young man. \nHe then \nattended Harvard, graduating with the class of 1911, the same year \nhe \nstarted his \nown \npractice \nin Detroit. \nMarr \nmarried \nthe \ngranddaughter \nof \nHerman Kiefer, \na \nprominent doctor \nand civic \nleader, and it ma y well be that this family connection provided \nhim entree into the circles for whom he designed large and elegant \nhouses, such as the impressive Tudor mansions of William A. Fisher \nand Alfred Fisher in Palmer Woods (NR). \nHe later practiced with \nhis son Carl as Marr and Marr, before his death in 1946 at age 60. \nThe original owner and sole proprietor of the ArchiLects Building \nwas \nThomas J. \nThompson \n(18 79-1926 ), \na \nman \nident ified with \nt he \nwholesale \nand retail meats, \nhotel and restaurant trade. \nHis \nfamily was associated with the Thompson Farm (Private Claim 272), \na French ribbon farm around 12th Street (now Rosa Parks Blvd. ) , \nand his brother and business partner, William B. Thompson, was a\n\nformer mayor of Detroit. \nEngaged in the purchase of real estate, \nThompson \ncentered \nmost \nof \nhis \nactivities \naround \nWest \nGrand \nBoulevard and Third. \nThompson died prematurely at the age of 4 7 \nin 1926, and the Architects Building remained in his estate until \n1936, when it was lost to foreclosure. \nMarr was the archi teet of Thompson's personal residence at 1666 \nWest Boston Boulevard in the Boston Edison Historic District, \nconstructed in 1917. \nMarr was also a resident of Boston-Edison. \nGiven their prior relationship, Marr may have come to Thompson \nwith the need for a one-stop-shop for architectural services and \nThompson, who purchased the property on Brainard in 1922, was able \nto accommodate him with the · erection of the Architects Building. \nThe listing from the 1925/ 26 Detroit City Directory appears as \nfollows: \nbasement: Peerless Blue Print Company \n1st floor: Humphry Company, heaters \nRooms : 203-5 \n301 \n304 \n401 \n402 \n403 \n427 \n429 \n457 \n503 \n505 \n506 \n508 \n601 \n603 \n606 \n608 \n- Pontiac Nursery Co. \nW.W. Essig & Company, landscape architects \nSukert, Lancelot, Architect \nAssociates Investment Co. \nHiggins Manufacturing Co., screens \nWhalen, Charles B., plumber \nFecheimer, Frank & Spedden, Inc., advertising \nagents \nJohnson Service Co., temperature regulating \nJohn H. Freeman, builders hardware \nKohns, Glenn J. \nSteffens, J.H., Architect \nCordner, G. Frank, Architect \nMills, Byron E., Architect \nBarnes, C.F.J., Architect \nNemadji Tile & Pottery Co. \nMetropolitan Finance Corp. \nGies, Roland c., Architect \nFinn, Robert, Architect \nMason, John H., Architect \nWheat, T.E. Moss, structural & c ivil \nengineering \nJohn, Carl E., contractor \n700 \n-\nBurrowes, Marcus R., Architect \nMarr, Richard H., Architect \nBurrowes & Eurich, Architect \n708 \nHill, Newell J., construction engineer\n\nAmong the better known architects in the building, in addition to \nMarr, were Lance lot Sukert, Roland C. Gies, Marcus R. Burrowes, \nand the partnership of Burrowes & Eurich. \nLancelot Sukert, a Detroit architect, was a native of Detroit born \nin 1888. \nHe studied architecture at the University of California, \nColumbia University, and the University of Pennsylvania. \nOur ing \nWorld War I, he was a first lieutenant in the aviation section of \nthe Signal Corps and erected aerodromes at the front. \nHe worked \nfor two years in the office of Albert Kahn before starting his own \npractice. \nAmong his works are the Scarab Club ( NR) , St. Columba \nChurch, Boulevard Congregational Church, St. Cyprian Church (City \nof Detroit Historic District) and St. Paul's Memorial Church, all \nin Detroit. \nHe \nalso did store fronts \nand \ninterior \nwork \nfor \ncommercial firms such as Tuttle and Clark and Sax-Kay. \nMarcus Burrowes, a New York state native, attended the Art Academy \nin Denver, Colorado, where he took up architecture. \nAccompanying \nhis parents to Sarnia, Ontario, Burrowes practiced architecture \nthere for five years before moving to Detroit in 1907. \nUpon \narr ival, he joined the firm of Stratton and Baldwin and remained \nwith \nthem \nfor \ntwo \nyears. \nIt is likely \nthat \nBurrowes \nwas \ninfluenced \nby \nthat firm's affection for \nthe English Domestic \nRevival just coming into vogue in this country. \nBurrowes was a \nmember of the Arts and Crafts Society in Detroit, a group founded \nto further the ideals of the Arts and Crafts movement by, among \nothers, Albert Kahn, William B. Stratton and Frank C. \nBaldwin. \nSubsequently, Burrowes formed the firm of Burrowes and Wells with \nDalton R. Wells; by 1914 he was in practice under his own name. \nBurrowes' office was then located in the Trussed Concrete Building \nat \n58 \nWest \nLafayette. \nAlbert \nKahn \nwas \nlocated in the \nsame \nbuilding, which must have led to friendly interaction since they \nboth did work at Cranbrook in the second decade of the twentieth \ncenury. \nBurrowes \nteamed \nup \nwith \nFrank \nEurich \naround \n1920 . \nBurrowes and Eurich designed many fine residences in the Grosse \nPointes, Bloomfield Hills, Farmington and Detroit. \nAssuming that \nthe \nprominent \nstatus \nof \ntheir \nclients \nreflected \ntheir \nown \nprominence \nas architects, \nBurrowes \nand \nEurich had \nachi eved \na \nsubstantial level of success in the Detroit area. \nThe fir m \ndesigned other kinds of buildings as well, including the mun ici pal \nbuilding in Grosse Pointe and libraries in Detroit and Birmingham, \nMichigan. \nRoland Gies designed a significant number of houses in Detroit's \npremier historic districts, and was responsible for ten i n Indian\n\nVillage alone. \nHe was briefly associated with H.J. Maxwell Grylls \nbefore Grylls joined the firm of Smith, Hinchman & Grylls in 1907. \nAutomobile production had become the leading industry in America \nin the 1920s; it was responsible for over seventy-five per cent of \nthe city's economy. \nConsequently, the Great Depression took a \nmore severe toll on Detroit than any other major American city as \nthe automobile industry collapsed. \nBuilding activity practically \nceased and great numbers of building-related firms went out of \nbusiness. \nBy 1932-33, only Steffens, Burrowes and Marr were left \nout of the original architects in the Architects Building, \nand \nmany offices lay empty. \nIn \n1950, \nthe \nArchitects \nBuilding \nwas \nreferred \nto \nas \nthe \nContractor's Storage Building. \nIt was connected by a concrete \nblock addition to the building at 3627 Cass when the latter was \nconstructed in the 1950's. \nThe entire property was sold to the \nSalvation \nArmy \nin \n1974 \nand \nto \nCass \nCorridor \nNeighborhood \nDevelopment Corporation in 1985.",
  "source_file": "95000531_architects_building.pdf"
}